# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)

import functions

# def find_indexes(arr, min_value, max_value):
#     indexes = []
#     for i in range(len(arr)):
#         if min_value <= arr[i] <= max_value:
#             indexes.append(i)
#     return indexes

n = int(input("Введите количество элементов в списке: "))
list_n = []
for i in range(n):
    list_n.append(functions.readint())
print(list_n)
# list_n = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_value = int(input("Введите минимум: "))
# min_value = 7
max_value = int(input("Введите максимум: "))
# max_value = 10

# result = find_indexes(list_n, min_value, max_value)
result = functions.find_indexes(list_n, min_value, max_value)
print(f"Индексы элементов массива, значения которых принадлежат заданному диапазону: {result}")










































































































































































































































































































































































































































































































































































































































































































































































































